{
    "userData": {

        "profile" : {
            "name": "Rohit Tirmanwar",
            "designation": "Senior Software Engineer",
            "displayImage": "assets/images/profile.jpg",
            "contact": {
                "email" : [
                    "rohit.tir2@gmail.com",
                    "rtirmaw@gmu.edu"
                ],
                "phone" : [
                    "+1 (571) 338-1143"
                ],
                "address": {
                    "name": "Reston, VA",
                    "locURL" : "https://goo.gl/maps/f6GmwRcvvks"
                }
            },
            "abstract": [
                "Hi there!! Welcome to my portfolio. Here you'll find all the details of my experience, skills, education and some personal projects. You can use the navigation on the top to jump to each section of this page.",
                "I'm a MEAN stack software developer with expertise in the front end design and development using Angular 2+, Redux, Node.js, GraphQL and the stack around it. ",
                "I have been recently working on the front end architecture design for an online Robo advisor investment product. It is a highly customizable white labelled architecture that provides run-time branding flexibility.",
                "It has been a long 8.5 years of journey in the software development during which the technologies kept changing and so my knwoeldge and curiosity of learning and putting them into practice.",
                "Having experties in Object Oriented prohramming language, it became easy for me to learn the new stack quickly and experience helped me using them for the right requirements/features.",
                "Please go through my complete profile below and download my resume using the button on the top right corner of this section."
            ]
        },

        "social": {
            "linkedin": "https://www.linkedin.com/in/rohit-tirmanwar",
            "github": "https://github.com/rohittir",
            "facebook": "https://www.facebook.com/rohit.tir",
            "twitter": "https://twitter.com/rohit_tir",
            "githubSource": "https://github.com/rohittir/rohit-website"
        },

        "resume" : {
            "pdf": "assets/data/Resume.pdf",
            "word": ""
        },

        "skills" : {
            "keywords": [
                "Angular 2, 4 and 6",
                "React",
                "Typescript",
                "Javascript",
                "ES6",
                "Node.js",
                "Express",
                "GraphQL",
                "MongoDB",
                "Redux",
                "RxJs",
                "Angular Material",
                "NativeScript For Angular",
                "HTML5",
                "CSS",
                "SASS",
                "AmCharts",
                "Java",
                "C++",
                "Spring",
                "JPA",
                "J2EE",
                "Hibernate",
                "MySQL",
                "NoSQL",
                "jQuery",
                "Mobile-First Strategy",
                "CSS Media Query",
                "CSS Grid",
                "ADA/508 Compliance",
                "JUnit",
                "Karma",
                "Jasmine",
                "Protractor",
                "Webpack",
                "Gulp",
                "Angular-CLI",
                "REST Services and API",
                "AWS S3 Storage",
                "AWS EC2 Container",
                "AWS CloudFront",
                "AWS DynamoDB",
                "ServerLess Architecture",
                "AWS API Gateway",
                "AWS Lambda",
                "D3.js",
                "Agile/Sprint",
                "VS Code",
                "Eclipse","NetBeans",
                "IntelliJIDEA",
                "Git",
                "SVN",
                "JIRA",
                "Bamboo for CI/CD",
                "Data Structures",
                "Design Patterns",
                "Problem Solving"
            ]
        },

        "education" : {
            "schools": [
                {
                    "name": "George Mason University",
                    "address": "Fairfax, VA",
                    "course": "Master of Science",
                    "major": "Software Engineering",
                    "startDate": "August 2016",
                    "endDate": "May 2018",
                    "logo": "assets/images/gmu-logo.jpg",
                    "websiteLink": "https://www2.gmu.edu/",
                    "courseWork": []
                },
                {
                    "name": "Government College of Engineering",
                    "address": "Amravati, India",
                    "course": "Bachelor of Technology",
                    "major": "Mechanical Engineering",
                    "startDate": "August 2007",
                    "endDate": "May 2011",
                    "logo": "assets/images/gcoea-logo.jpg",
                    "websiteLink": "https://www.gcoea.ac.in",
                    "courseWork": []
                }
            ]
        },

        "experience" : {
            "industries": [
                {
                    "label": "Hobsons",
                    "name": "Hobsons, Inc.",
                    "address": "Arlington, VA",
                    "startDate": "July 2019",
                    "endDate": null,
                    "designation": "Sr. Software Engineer",
                    "logo": "assets/images/folio.png",
                    "websiteLink": "https://www.hobsons.com",
                    "abstract": [
                        "Design and develop web based software products in education technology using technologies around React, Node.js and MongoDB.",
                        "Work in Agile to collaborate with product team, design team, QA and operations and involve throughtout SDLC process."
                    ],
                    "detailedInfo": [
                        "Worked closely with the product team, project manager and UX team to design and develop web-based enterprise software products in education space i.e. Naviance and Intersect.",
                        "Worked on design and development of front-end and back-end software components using technologies and frameworks that include React, Redux, ES6, Typescript, Node.js, Express.js, GraphQL, MongoDB, and AWS.",
                        "Developed by test driven and behavior driven development approach using JavaScript testing frameworks and libraries that include Jasmine, Karma, Protractor, Chai and Cypress.",
                        "Designed and implemented back-end services using GraphQL schemas and mutation in Node.js and consumed those in front-end React based components through Apollo client with proper caching in place.",
                        "Implemented React based front-end components using ES6, Semantic-ui and other JavaScript libraries.",
                        "Implemented complex MongoDB queries and algorithms to achieve complex student and college matching requirements.",
                        "Led a technical team of 5 engineers to design and develop a major part of the product to build from scratch."
                    ],
                    "technologies": [
                        "Angular 4 and 6", "Typescript", "NativeScript", "Angular Material", "Node.js", "GraphQL", "Redux", "RxJs", "SASS", "CSS", "HTML", "AmCharts.js", "Agile", "Karma", "Jasmine", "Webpack", "Gulp", "JIRA"
                    ]
                },
                {
                    "label": "Folio",
                    "name": "Folio Financial, Inc.",
                    "address": "Mc Lean, VA",
                    "startDate": "July 2018",
                    "endDate": "July 2019",
                    "designation": "Front End Engineer",
                    "logo": "assets/images/folio.png",
                    "websiteLink": "https://www.folioinvesting.com/folioinvesting/home/",
                    "abstract": [
                        "Design and develop front end of financial products using technologies around Angular, Node.js and GraphQL",
                        "Work in Agile to collaborate with design team, QA and back end team for UI requirements and release."
                    ],
                    "detailedInfo": [
                        "Worked closely with the product owner, design team and back end engineers to design and develop the front end interface of an online Robo financial investment and brokerage application.",
                        "Worked on developing a white-labeled front-end architecture using Angular 6, that can be configured as a BRAND, using various configurations at runtime for various styles, colors, content and features.",
                        "Developed a common library in Angular, that captures common business requirements and published to private npm repository, which are imported as a npm package to use in multiple relevant applications.",
                        "Worked on state management using Redux based architecture, that stores all the data (state) at one place and the relevant components can subscribe to the reducer events, to alter  their views based on the state.",
                        "Implemented various GraphQL Schemas and Mutations in Node.js framework based on the requirements to consume back end REST APIs.",
                        "Implemented various Angular components with material views, styled using SASS, applied colors using variables and mixins, layouts with responsive and mobile-first strategy, supporting cross-browser compatibilities.",
                        "Worked on design and development of native ios mobile application using NativeScript for Angular.",
                        "Worked using Webpack, Angular-cli for various configurations including AOT builds, created gulp tasks for packaging common library and branded Angular components and modules.",
                        "Improved the old architecture, which resulted in reduction up to 80% of the time spent on adding new features."
                    ],
                    "technologies": [
                        "Angular 4 and 6", "Typescript", "NativeScript", "Angular Material", "Node.js", "GraphQL", "Redux", "RxJs", "SASS", "CSS", "HTML", "AmCharts.js", "Agile", "Karma", "Jasmine", "Webpack", "Gulp", "JIRA"
                    ]
                },
                {
                    "label": "gmu",
                    "name": "George Mason University",
                    "address": "Fairfax, VA",
                    "startDate": "January 2017",
                    "endDate": "May 2018",
                    "designation": "GRA / Front End Engineer",
                    "logo": "assets/images/gmu-logo.jpg",
                    "websiteLink": "https://www2.gmu.edu/",
                    "abstract": [
                        "Design and develop web application",
                        "Manage sprint plan using agile"
                    ],
                    "detailedInfo": [
                        "Designed and developed the front-end of a web application to help analyzing intelligence problems with online collaboration of multiple analysts and crowdsourcing.",
                        "Implemented major features with styled views including online messaging, online training, interface help tutorials, tree based argumentation etc.",
                        "Improved user experience by developing easy to understand and responsive interface, which reduced 70% of the time for new users to analyze and solve the intelligence problems.",
                        "Implemented reusable and loosely coupled front-end components using Angular 2.0 framework, Typescript and applied responsive styles using CSS and Bootstrap library.",
                        "Designed and implemented Angular services using HTTP and Promise for back-end integration using RESTful APIs and proper error handling.",
                        "Worked in Agile and test-driven development settings to plan features and release in short interval MVPs.",
                        "Implemented end-to-end unit tests using Karma and Jasmine in Angular.",
                        "Led and managed bi-weekly sprint plans and daily standup meetings for a team of 5 people."
                    ],
                    "technologies": [
                        "Angular 2", "Typescript", "ES6", "CSS3", "HTML5", "Agile", "Java", "Karma", "Jasmine", "Webpack", "VS Code"
                    ]
                },
                {
                    "label": "ge",
                    "name": "General Electric",
                    "address": "Bangalore, India",
                    "startDate": "August 2014",
                    "endDate": "July 2016",
                    "designation": "Lead Engineer",
                    "logo": "assets/images/ge-logo.png",
                    "websiteLink": "https://www.ge.com/",
                    "abstract": [
                        "Design and develop software and web application",
                        "Participate in requirement gathering and project reviews with funtional team"
                    ],
                    "detailedInfo": [
                        "Worked on a web based product development using Java to integrate over 200 design tools as part of a single system, for better hand-offs with effective data transfer and communication.",
                        "Implemented front-end interface for the product using JavaScript, jQuery, CSS3, SASS and HTML5",
                        "Created and implemented a custom CSS grid system, with CSS media queries for mobile responsiveness.",
                        "Consulted and documented UI best practices and code standards to maintain and improve performance and security.",
                        "Led a critical project in alpha stage which was running late for more than 6 months and productionized by utilizing only 50% of the anticipated time, following Agile/sprint process in planning and development.",
                        "Participated in gathering functional requirements with US based stake-holders and effectively converted functional requirements to use cases and successful implementations.",
                        "Worked as a single point of contact to US based stake-holders and had been the part of all phases of software lifecycle, with a successful deployment of the first version in production.",
                        "Improved performance of a critical parameter computation in a Nacelle design tool by 4 times, using techniques like least square fitting algorithm and parallel computation."
                    ],
                    "technologies": [
                        "Java", "Javascript", "CSS3", "HTML5", "Agile", "SVN", "JIRA", "Agile/Sprint Planning", "Jenkins", "Eclipse"
                    ]
                },
                {
                    "label": "geometric",
                    "name": "Geometric Limited",
                    "address": "Pune, India",
                    "startDate": "June 2011",
                    "endDate": "August 2014",
                    "designation": "Software Engineer",
                    "logo": "assets/images/geometric-logo.png",
                    "websiteLink": "https://geometricglobal.com/",
                    "abstract": [
                        "Design and develop software application",
                        "Perform and document unit tests and design"
                    ],
                    "detailedInfo": [
                        "Designed and developed the graphical user interface using MFC and QT, to provide the best user experience.",
                        "Worked on a CAD based software product development DFMPro using C++ and computational geometry techniques.",
                        "Implemented logic for recognizing manufacturing features modeled on dumb geometry, which involves a great problem solving and algorithm skills.",
                        "Developed a feature to pass a successful contract which helped increasing the product sales by more than 40%.",
                        "Mentored team members about newly available APIs of NX by self-learning them in a short time.",
                        "For the excellent performance, got appreciated with GeoChamp and Star Performer awards for the year 2013, which is presented each year to only one person in the entire section."
                    ],
                    "technologies": [
                        "C++", "QT", "MFC", "Computational Geometry", "CAD Development", "Product Development", "NX Customization", "Visual Studio", "SVN", "JIRA", "QuickBuild"
                    ]
                }
            ]
        },

        "academic": {
            "projects": [
                {
                    "name": "Chain Reaction",
                    "date": "December 2017",
                    "abstract": [
                        "Designed architecture and developed a secure online multiplayer game using Node.js framework, CSS, HTML, JavaScript and MySQL.",
                        "Maintained high quality of code for not compromising on security and ensured proper input validation, prepared statements to avoid vulnerabilities including XSS, CSRF and data injections",
                        "Best practices are used from OWSAP and concepts learned in Secure Software Engineering course at GMU."
                    ],
                    "referenceLink": "https://github.com/rohittir/chain-reaction"
                },
                {
                    "name": "Virtual Restaurant Service",
                    "date": "May 2017",
                    "abstract": [
                        "A responsive and adpative interafce is designed and developed for a web based application that features virtual experience of restaurant booking, service and others.",
                        "Designed and developed front end for online and mobile ordering of the food that could be served in the restaurant including features like table reservation, pre booking, pre ordering and continuous feedback.",
                        "Front end of the website is designed using the concept of UX those are learned through UI Design and Development course at GMU."
                    ],
                    "referenceLink": "https://github.com/rohittir/Restaurant-Service"
                },
                {
                    "name": "Dynamic Theming with CSS Variables",
                    "date": "May 2019",
                    "abstract": [
                        "An Angular application that provides a way to change it's color and styles at runtime using custom css properties/variables.",
                        "This enables way to create and apply various themes by providing styles and colors without rebuilding and redeplopying the front end code."
                    ],
                    "referenceLink": "https://github.com/rohittir/dynamic-theming-with-css-variables",
                    "liveDemo": "http://dynamic-theming.s3-website-us-east-1.amazonaws.com"
                }

            ]
        }

    }
}











